# Curso de Python para Analisis de Datos

## Clase 5


#### Indice:
        Pandas
            Series
            Data Frames
            .read_csv
            .head()
            .tail()
            .loc
            .iloc
            .dtypes()
            Missing Values
            .dropna()
            .groupby()
            .fillna()
            .rename()
            .astype()
            .unique()
            .value_counts()
            .reset_index()
            .corr()

## Modulo 2: Pandas-Conociendo un dataset

Una de las primeras cosas que debe realizar un Data Scientist al iniciar un nuevo proyecto es conocer el dataset con el cual va a trabajar. Este paso se conoce como _"Analisis exploratorio de los datos"_. Es útil para saber que tipo de datos contiene el dataset, obtener estadistica descriptiva y detectar problemas como valores faltantes (o missing values). 

Pandas es una gran ayuda para manejar nuestros dataset. En la clase de hoy, veremos algunos conceptos basicos de pandas y como leer datasets.

<img src="pandas.series.png">

<img src="pandas.dataframe.png">

In [2]:
#importa numpy
import numpy as np
#importa pandas
import pandas as pd

In [ ]:
serie = pd.Series(data = [1,2,3, 4, 6.7], 
          index=['primero', 'segundo' ,'tercero', 'cuarto', 'quinto'])

In [ ]:
type(serie)

In [ ]:
serie

In [ ]:
serie.columns

In [ ]:
df = pd.DataFrame(data = [1,2,3, 4, 6.7], 
          index=['primero', 'segundo' ,'tercero', 'cuarto', 'quinto'])

In [ ]:
df.index

In [ ]:
df.columns

Pandas nos facilita con varias funciones para leer archivos. Entre ellas podemos encontrar:

- `.read_csv()`: lee archivos `csv` como DataFrame
- `.read_json()`: lee archivos `json` como DataFrame
- `.read_excel()`: leer archivos `excel` como DataFrame

Para conocer más funciones que ayuden a leer archivos, consulta [acá](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)

Nosotros vamos a usar [`.read_csv()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html).

Los archivos `csv` son un tipo de documento en formato abierto sencillo para representar datos en forma de tabla, en las que las columnas se separan por comas (o punto y coma) y las filas por saltos de línea. Es uno de los formatos más utilizados en Data Science.

La sintaxis para poder leer un archivo csv es: 
    
`df = pd.read_csv('nombredelarchivo.csv', delimiter=',')`

Aunque muchas veces se omite el `delimiter` si el archivo esta separado por comas.

Vamos a trabajar con el archivo `StudentsPerformance.csv` (Lo podes encontrar en la carpeta Clase2). Es usual descargar el archivo `csv` en la misma carpeta en la que trabajas con el jupyter notebook. De esta manera, no tendras que especificar el path a tu archivo.

1) Lee el archivo csv `StudentsPerformace` usando `pandas`. Guardalo en una variable llamada `students`.

In [51]:
students = pd.read_csv("/home/ivan/Descargas/AD - 5/Recursos/StudentsPerformance.csv")

In [52]:
students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,NaN,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [4]:
students.index

RangeIndex(start=0, stop=1000, step=1)

In [5]:
students.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

2) ¿Que tipo de estructura de datos contiene la variable `students`? _Hint_: Usa `type`

In [6]:
type(students)

pandas.core.frame.DataFrame

3) ¿Cuantas filas y columnas tiene `students`? Para contestar esta pregunta, pandas tiene la funcion `.shape`. Su sintaxis es la siguiente: `df.shape` (`df` debe ser reemplazado por el nombre de tu `DataFrame`). 


De ahora en más cuando nos refiramos a un tipo de sintaxis donde debe colocarse `nombre_del_data_frame.funcion()`, la mencionaremos como `.funcion()`.

¿Que devuelve esta funcion? ¿Cual crees que corresponde a las filas y cual a las columnas?


**Numero de filas**: ____

**Numero de columnas**: ____

In [ ]:
students.shape

3) ¿Cual es el nombre de las columnas contenidas en `students`? Para esto, pandas tiene el atributo `.columns`.

In [ ]:
students.columns

4) Inspecciona las primeras 10 filas de `students` usando la función `.head()`. Dentro de esta función podemos colocar un numero. Este numero nos dira cuantas filas queremos observar.

In [ ]:
students.head()

5) Ahora inspecciona las 10 ultimas usando `.tail()`. También podemos indicar el número de filas que queremos observar.

In [ ]:
students.tail(10)

6) ¿Que tipos de datos contiene cada una de las columnas de `students`? Para esto, utiliza el atributo `.dtypes`.

In [ ]:
students.dtypes

7) ¿Como accedemos a una fila o a una columa de un DataFrame?

Una de las maneras de acceder a una columna es especificando el nombre de la misma. Por ejemplo, `df['nombre_columna']`.

- Accede a la columna `gender` de `students`.

In [7]:
students['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

- Accede ahora a la columna `lunch`.

In [8]:
students['lunch']

0          standard
1          standard
2          standard
3      free/reduced
4          standard
           ...
995        standard
996    free/reduced
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

In [ ]:
students.lunch

Otra manera de acceder es usando dos funciones `.loc[]` y `.iloc[]`.

- `iloc[1:m, 1:n]`: Se usa para seleccionar filas basadas en su posición de 1 a m filas y de 1 a n columnas.

In [9]:
#seleccionar las dos primeras filas y 3 columnas
students.iloc[:2, :3]

   gender race/ethnicity parental level of education
0  female        group B                         NaN
1  female        group C                some college

In [12]:
#o tambien se usa para las dos primeras filas y todas sus columnas
students.iloc[:2,]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,NaN,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88

In [ ]:
#Selecciona los datos entre la decima y vigesima fila.
students.iloc[10:21]

In [ ]:
#Selecciona las dos primeras columnas 
students.iloc[:, :2]

- `.loc[[nombre_fila], [nombre_columna]]`. Se usa para seleccionar filas o columnas basadas en su nombre

In [13]:
#Selecciona la fila por nombre 1, o sea con indice igual a 1
students.loc[1]

gender                               female
race/ethnicity                      group C
parental level of education    some college
lunch                              standard
test preparation course           completed
math score                               69
reading score                            90
writing score                            88
Name: 1, dtype: object

In [14]:
#Corre el codigo y observa que devuelve
students.loc[[1,20,3,4,5],['gender','lunch']]

    gender         lunch
1   female      standard
20    male      standard
3     male  free/reduced
4     male      standard
5   female      standard

In [15]:
#Selecciona las filas con indices 3, 10, 30, 43, 43 y columnas reading score y writing score
students.loc[[3, 10, 30, 43, 43], ['reading score', 'writing score']]

    reading score  writing score
3              57             44
10             54             52
30             74             74
43             65             66
43             65             66

In [22]:
df2 = pd.DataFrame(data = [['perro', 2], ['gato',4], ['flor',8]], index = ['str1', 'str2', 'st32'], columns=[['titulo'],['edad']])

ValueError: 1 columns passed, passed data had 2 columns

In [17]:
df2

     titulo
str1  perro
str2   gato
st32   flor

In [18]:
df2.loc['str2']

titulo    gato
Name: str2, dtype: object

In [ ]:
df2.iloc[1]

 A veces queremos seleccionar filas que cumplan con ciertas condiciones, donde el valor de una columna en esa fila sea igual, mayor o menor que un valor.

Para esto tenemos que usar una sintaxis especial. Vamos a construirla de a poco. Imaginemos que tenemos un DataFrame `df` con las columnas `col1`, `col2` y `col3`. Queremos seleccionar solo aquellas filas donde `col1` sea mayor a 10.

Para eso diremos que queremos

`df['col1'] > 10` (La columna col1 debe ser mayor a 10). 
Ahora si corremos este codigo, veremos que devuelve valores booleanos. O sea devolvera False para aquellos valores que sean menores o iguales a 10 y True para los que sean mayores a 10.

O sea que tenemos que agregar algo mas para poder seleccionar las columnas. Esta lista de valores booleanos se llama mascara booleana. 

¿Que significa? Que si yo le paso estos valores a pandas, pandas interpretara que debe conservar aquellos valores donde tiene True y descartar donde tiene False.

Por eso, para filtrar filas en base a estas condiciones escribimos:

**`df[df['col1] > 10]`**

Esto significa primero fijate en que filas de `df`, la columna `col1` es mayor a 10. Luego, selecciona solo aquellas filas donde esta condicion sea `True`.

In [23]:
#Selecciona solo las filas donde math score sea mayor a 70
students[students['math score'] > 70]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,NaN,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
984,female,group C,some high school,standard,none,74,75,82
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
995,female,group E,master's degree,standard,completed,88,99,95
999,female,group D,some college,free/reduced,none,77,86,86

In [ ]:
#Selecciona solo las filas donde reading score sea menor a 60
students[students['reading score'] < 60]

In [ ]:
#Selecciona solo las filas donde gender sea igual a female
students[students['gender'] == 'female']

In [ ]:
#Selecciona solo aquellas filas donde lunch sea distinto a standard
students[students['lunch']!='standard']

In [ ]:
#Muestra los valores de writing score para aquellos estudiantes que tengan reading score mayor a math score
students[students['reading score'] > students['math score']]['writing score']

In [25]:
#Selecciona aquellos estudiantes que posean reading and writing score mayor a 70
students[(students['reading score']>70)&(students['writing score']>70)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,NaN,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [31]:
students[(students['race/ethnicity'] == 'group B') & (students['lunch'] != 'standard') & (students['math score'] > 70)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
116,female,group B,bachelor's degree,free/reduced,none,75,85,82
160,male,group B,associate's degree,free/reduced,completed,82,78,74
199,female,group B,bachelor's degree,free/reduced,none,78,79,76
208,female,group B,some college,free/reduced,none,74,81,76
279,male,group B,bachelor's degree,free/reduced,none,73,56,57
288,male,group B,bachelor's degree,free/reduced,none,88,75,76
514,female,group B,master's degree,free/reduced,completed,77,97,94
551,male,group B,bachelor's degree,free/reduced,completed,87,90,88
642,female,group B,some high school,free/reduced,none,72,81,79
667,female,group B,bachelor's degree,free/reduced,none,77,85,87
715,female,group B,associate's degree,free/reduced,completed,76,94,87
722,female,group B,some high school,free/reduced,completed,74,90,88
782,female,group B,high school,free/reduced,completed,76,85,82
823,female,group B,high school,free/reduced,none,71,87,82
843,male,group B,some college,free/reduced,completed,74,77,76
856,male,group B,some college,free/reduced,none,75,68,65

In [34]:
students['math score'] > 70

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

### Missing Values o Valores faltantes

Los valores faltantes son un problema muy grande a la hora de visualizar y limpiar datos así como también a la hora de entrenar un modelo. Uno de los pasos obligados de cualquier exploración de datos es evaluar la presencia de estos valores.

Como manejar estos datos faltantes es un gran desafio. La mayoría de las veces no queremos eliminar esos valores porque significaría perder información valiosa en otros features. 

Los valores faltantes estan codificados normalemente como `NaN`. Esto no es un string, sino que es un valor especial de `NumPy` que es tratado como un flotante.

Otra forma de encontrar un dato faltante es de la forma `None` (objeto de Python que representa ausencia de dato)

Para chequear si tenemos valores faltantes podemos usar la función `.isnull()`. Esto nos devuelve una nueva DataFrame en la cual tendremos el valor False si no es faltante y True si ese valor es faltante.

In [53]:
#Usa .isnull() para ver que ocurre
students.isnull()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,False,False,True,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False

In [65]:
students[students['race/ethnicity'].isna()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
268,female,NaN,associate's degree,standard,completed,88,92,95
390,male,NaN,some high school,free/reduced,completed,73,67,59
429,male,NaN,some high school,free/reduced,none,68,63,54
675,female,NaN,some college,standard,completed,50,64,66
696,female,NaN,associate's degree,standard,completed,75,82,90
723,male,NaN,high school,standard,none,50,48,42
803,female,NaN,some college,standard,none,82,85,87
814,female,NaN,high school,standard,none,72,80,83
848,female,NaN,high school,standard,none,59,72,68
947,female,NaN,some college,free/reduced,none,49,58,60
981,male,NaN,some high school,standard,none,81,78,78

In [66]:
students[students['race/ethnicity'].notna()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,NaN,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [62]:
#Prueba usar .isnull().sum() sobre tu dataframe para ver que devuelve
students.isnull().sum()

gender                          0
race/ethnicity                 11
parental level of education    10
lunch                           5
test preparation course        15
math score                      0
reading score                   0
writing score                   0
dtype: int64

¿Hay valores faltantes en alguna de las columnas de `students`? Si

Si la cantidad de valores faltantes es poca, podemos entonces deshacernos de ellas. Para esto pandas ofrece la función [`.dropna()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html). Esta función hara que se eliminen las filas donde hay valores faltantes. Si no le pasamos ningun parametro extra, eliminara todas las filas con valores faltantes. Sin embargo, podes chequear en la documentación como eliminar solo algunas de las filas.

In [39]:
#Elimina todas las filas que tengan valores faltantes. No te olvides de poner inplace=True dentro de la función.
students.dropna(inplace=True)

Una manera de ver facilmente algunos detalles estadisticos de cada columna de un DataFrame es usando la fución `.describe()`.

In [42]:
#Usa la funcion .describe() sobre students y describe que informacion estadistica proporciona
students.describe()

       math score  reading score  writing score
count  959.000000     959.000000     959.000000
mean    65.997914      69.164755      67.991658
std     15.107617      14.558068      15.090677
min      0.000000      17.000000      10.000000
25%     57.000000      59.000000      57.000000
50%     66.000000      70.000000      69.000000
75%     77.000000      79.000000      78.500000
max    100.000000     100.000000     100.000000

Tambien es posible visualizar, por ejemplo, el promedio de una columna. Para esto pandas usa la función de numpy, pero provee la misma sintaxis que las demás funciones. Por ejemplo, si queremos calcular el promedio de la columna `col1` del DataFrame `df` usamos `df['col1'].mean()`.

In [72]:
#Calcula el promedio de la columna math score de students
students['math score'].mean()

66.089

In [84]:
students['math score'].astype('float')

ValueError: could not convert string to float: 'asd'

También podemos usar funciones como `.min()`, `.max()`, `.median()`, `.std()`.

In [44]:
#Calcula el minimo y maximo valor, la mediana y el desvio estandard en la columna math score de students
students['math score'].min()

0

In [45]:
students['math score'].max()

100

In [46]:
students['math score'].median()

66.0

In [47]:
students['math score'].std()

15.107616594070446

[Investiga](https://pandas.pydata.org/pandas-docs/stable/index.html) y trata de aplicar las siguientes funciones de `pandas`:

- `.index`

In [48]:
#Veo el indice de las columnas
students.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            990, 991, 992, 993, 994, 995, 996, 997, 998, 999],
           dtype='int64', length=959)

In [49]:
#Asigno un nuevo nombre para los indices de las columnas
#Algo que no comentamos es que las columnas tambien se pueden acceder a traves
#de usar dataframe.nombredelacolumna. Esta nomenclatura en algunos casos hace que 
#sea mas rapida la escritura del codigo pero tambien tenemos que tener cuidado 
#porque es incompatible con los nombres de las columnas que contengan espacios
students.index = students.gender

In [50]:
students.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
gender,,,,,,,,
female,female,group C,some college,standard,completed,69,90,88
female,female,group B,master's degree,standard,none,90,95,93
male,male,group A,associate's degree,free/reduced,none,47,57,44
male,male,group C,some college,standard,none,76,78,75
female,female,group B,associate's degree,standard,none,71,83,78

- `.drop()`

In [ ]:
#elimina una columna (axis=1) o  una fila (axis=0) que cumpla con la condicion que le ponga
students.drop('gender', axis=1, inplace=True)

In [ ]:
students.head()

- `.groupby()`

In [ ]:
#agrega las distintas filas. sirve para obtener medidas agrupadas por alguna caracteristica
students.groupby('lunch')['math score'].mean()

- `.fillna()`

In [ ]:
#si hay valores nullos llena esos valores con el valor que proveamos
students['lunch'].fillna('standard', inplace=True)

- `.rename()`

In [ ]:
#sirve para renombrar columnas, indices, etc
students.rename(columns={'lunch': 'meal'}, inplace=True)

In [ ]:
students.head()

- `.astype()`

In [ ]:
#convierte las columnas entre tipo de datos
students['math score'].astype(str)

- `.unique()`

In [88]:
#Obtiene los valores unicos de una variable categorica
lunches = students['lunch'].unique()
for i in lunches:
    print(i)

standard
free/reduced
nan

array(['standard', 'free/reduced', nan], dtype=object)

- `.value_counts()`

In [ ]:
#cuenta la cantidad de veces que cada nivel de una variable categorica aparece
students['race/ethnicity'].value_counts()

- `.count()`

In [ ]:
#cuenta los valores no nulos.
students.count()

- `.reset_index()`

In [ ]:
#resetea los indices de una df
students.reset_index(drop=False)

## Ejercicios
Hacer una una función que importe el archivo  StudentsPerformance.csv y realizar:

- guardar el en una variable el dataframe (dt)
- guardar en la variable shape_date el shape
- guardar en la variable columns_dt las columnas
- guardar en la variable tail_dt los ultimos diez objetos
- guardar en la variable null_sum_df todos los objetos que son de tipo null
- Selecciona aquellos estudiantes que posean reading and writing score mayor a 85 y guardarlo en la variable students_dt
- guardar en la variable stads_df la estadistica de df usando df y retornala.

In [3]:
#guardar el en una variable el dataframe (dt)
students = pd.read_csv('/mnt/NFS/Documentos/03.Software/03.Ejercicios programacion/Curso Analisis de Datos con Python/AD - 5/Recursos/StudentsPerformance.csv')

In [5]:
#guardar en la variable shape_date el shape
shape_date = students.shape
shape_date

(1000, 8)

In [6]:
#guardar en la variable columns_dt las columnas
columns_dt = students.columns
columns_dt

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [7]:
#guardar en la variable tail_dt los ultimos diez objetos
tail_dt = students.tail(10)
tail_dt

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [17]:
#guardar en la variable null_sum_df todos los objetos que son de tipo null
null_sum_df = students.isnull()
null_sum_df.sum()

gender                          0
race/ethnicity                 11
parental level of education    10
lunch                           5
test preparation course        15
math score                      0
reading score                   0
writing score                   0
dtype: int64

In [26]:
#Selecciona aquellos estudiantes que posean reading and writing score mayor a 85 y guardarlo en la variable students_dt
students_dt = students[(students['reading score'] > 85) & (students['writing score'] > 85)]
students_dt

In [28]:
#guardar en la variable stads_df la estadistica de df usando df y retornala.
stads_df = students.describe()
stads_df

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000